app/controllers/chat_controller.rb

    def room
        @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 47)

    def update
        user = User.find(params[:id])
        #get all the not fetched messages for the current user
        @messages = Message.find :all, :conditions => ["sended_at > ?", user.last_update]
        #update the current user last update
        user.last_update = Time.now.to_f
        user.save
---
SELECT * FROM "users" WHERE ("users"."id" = 47)
SELECT * FROM "messages" WHERE (sended_at > 1298266367.56739)
UPDATE "users" SET "updated_at" = '2011-02-21 05:32:50', "last_update" = 1298266370.12485 WHERE "id" = 47

    def create_user
        @user = User.new(params[:user])
        @user.last_update = Time.now.to_f
        respond_to do |format|
          if @user.save
---
INSERT INTO "users" ("name", "last_update", "created_at", "updated_at") VALUES('jm', 1298266367.56739, '2011-02-21 05:32:47', '2011-02-21 05:32:47')

    def create_message
        @message = Message.new(params[:message])
        @message.sended_at = Time.now.to_f
        respond_to do |format|
            if @message.save
---
INSERT INTO "messages" ("sended_at", "created_at", "updated_at", "text", "user_id") VALUES(1298305632.26823, '2011-02-21 16:27:12', '2011-02-21 16:27:12', 'Just type \[ \int_0^\infty e^{-x}\,dx \] to renderice: